<%@ Page Title="" Language="C#" MasterPageFile="~/MasterPage.master" AutoEventWireup="true" CodeFile="extrariddles.aspx.cs" Inherits="extrariddles" %>

<asp:Content ID="Content1" ContentPlaceHolderID="head" Runat="Server">
</asp:Content>
<asp:Content ID="Content2" ContentPlaceHolderID="mainContent" Runat="Server">
    <link href="Styles/bigflippingcard.css" rel="stylesheet" />
    <h2>אקסטרה חידות</h2>
    <p>
        שלום! הגעתם לחידות אקסטרה קשות!
        <br />
        החידות פה ברמה מאוד גבוהה וכבר קשה מאוד לפתור אותן
        <br />
        בהצלחה!
    </p>
    <br />
    <br />
    <nav class="navigation">
        <ul>
            <li class="he">
                <div class="flip-card">
  <div class="flip-card-inner">
    <div class="flip-card-front">
        <br />
        <br />
      <p>
           האחים רד וגולדן משחקים במשחק. במשחק יש 2 ערימות, אחת של אגסים ואחת של תפוזים. בכל תור, על השחקן שזהו תורו לקחת 1 עד 4 אגסים מהערימה הראשונה ו-1 עד 3 תפוזים מהערימה השניה. חובה עליו לקחת מ-2 הערימות. השחקן שבתורו לא יכול לבצע מהלך חוקי מפסיד. כעת תורו של רד, ויש במשחק 113 אגסים ו-225 תפוזים. האם רד יכול להבטיח ניצחון במשחק, בהנחה שהוא ישחק באופן הטוב ביותר? אם כן, רשמו מהלך כלשהו שהוא יכול לעשות על מנת להבטיח ניצחון. אם יש כמה כאלו כל אחד מהם יתקבל. מהלך יסומן ב-2 ספרות, הראשונה (השמאלית) היא מספר התפוזים שלוקחים בתור זה והשניה (הימנית) היא מספר האגסים. למשל, 12 אומר שלוקחים תפוז אחד ו-2 אגסים במהלך המתואר. אם רד לא יכול להבטיח ניצחון במשחק, כיתבו 00.
      </p>
    </div>
    <div class="flip-card-back">
        <br />
        <br />
        <br />
        <br />
        <br />
        <br />
        <br />
      <p>
         13
      </p>
    </div>
  </div>
</div>
            </li>
            <li class="he">
                <div class="flip-card">
  <div class="flip-card-inner">
    <div class="flip-card-front">
        <br />
        <br />
        <p>
            לענת סדרת מספרים, חלקם שליליים וחלקם חיוביים. ענת מידי פעם אוהבת לשחק בסכומים. היא מתחילה מהמספר הראשון בסדרה, מוסיפה לו את המספר השני, ואז את השלישי, וכו', לפי הסדר (מימין לשמאל), עד שהיא סוכמת את כל המספרים. היא מאוד עצובה כשיש לה סכום שלילי (קטן מאפס), והיא אפילו מוכנה לשנות את הסימן של חלק מהמספרים בסדרה שלה, כדי שכשהיא תשחק בסכומים מצב כזה לעולם לא יקרה, כלומר כל הסכומים של הרישות (סכומים של k האיברים הראשונים בסדרה שלה, כש-k בין 1 לאורך הסדרה כולל, עבור כל k ,יהיו חיוביים (גדולים או שווים לאפס). ענת עצלנית ורוצה לשנות את הסימן של כמה שפחות מספרים בסדרה. מה המספר הקטן ביותר של שינויי סימן שענת תצטרך לעשות, אם הסדרה היא:
סוף- 4 ,-2 ,-2 ,-1 ,3 ,-2 ,3 - התחלה
        </p>
    </div>
    <div class="flip-card-back">
        <br />
        <br />
        <br />
        <br />
        <br />
        <br />
        <br />
      <p>
          2
      </p>
    </div>
  </div>
</div>
            </li>
            <li class="he">
                <div class="flip-card">
  <div class="flip-card-inner">
    <div class="flip-card-front">
        <br />
        <br />
        <br />
        <br />
        <br />
      <p>
          סעיף ב' מהשאלה הקודמת:
סוף- 9 ,-5 ,-19 ,-17 ,-3 ,-2 ,-13 ,-10 ,-12 ,-15 התחלה
      </p>
    </div>
    <div class="flip-card-back">
        <br />
        <br />
        <br />
        <br />
        <br />
        <br />
        <br />
      <p>
          4
      </p>
    </div>
  </div>
</div>
            </li>
            <li class="he">
                <div class="flip-card">
  <div class="flip-card-inner">
    <div class="flip-card-front">
        <br />
        <br />
        <br />
        <br />
        <br />
      <p>
          סעיף ג מהשאלה הקודמת:
סוף- 8 ,-15 ,-10 ,-10 ,-15 ,-3 ,-17 ,-11 ,-7 ,-3 ,-9 ,-19 ,-16 ,-2 ,-12 התחלה
      </p>
    </div>
    <div class="flip-card-back">
        <br />
        <br />
        <br />
        <br />
        <br />
        <br />
        <br />
      <p>
          5
      </p>
    </div>
  </div>
</div>
            </li>
            <li class="he">
                <div class="flip-card">
  <div class="flip-card-inner">
    <div class="flip-card-front">
        <br />
      <p>
          גברת פינק ויונתן משחקים במשחק על שביל ישר אינסופי. יונתן עומד במקום כלשהו על השביל. גברת פינק מסדרת על השביל 100 דובדבנים במרחק שווה של מטר אחד מהשני, כשאת אחד מהדובדבנים האלו היא שמה בדיוק במקום שבו יונתן עומד כעת (היא יכולה לבחור כמה דובדבנים לשים לפני ואחרי יונתן). בהתחלה יונתן מוכרח לאכול את הדובדבן שנמצא במקום שלו, ואז, בכל תור, גברת פינק אומרת ליונתן ללכת לאחד מהדובדבנים שנשארו על השביל, ואז יונתן הולך לדובדבן שגברת פינק ציינה ואוכל אותו. המשחק נגמר כשיונתן אוכל את כל הדובדבנים על השביל. גברת פינק רוצה שיונתן ילך מרחק כמה שיותר גדול במשחק, והיא מסדרת את הדובדבנים ובוחרת דובדבן בכל תור בהתאם. מה המרחק הארוך ביותר (במטרים) שיונתן יכול ללכת במשחק?
שימו לב שבכל שלב גברת פינק מוכרחה לתת ליונתן מיקום שבו אכן נמצא דובדבן, ויונתן מוכרח ללכת אליו בקו ישר (מבלי לסטות מהשביל) ולאכול אותו, וגם שיונתן בהתחלה חייב לאכול את הדובדבן שעליו הוא נמצא לפני שגברת פינק אומרת לו את היעד הראשון.
      </p>
    </div>
    <div class="flip-card-back">
        <br />
        <br />
        <br />
        <br />
        <br />
        <br />
        <br />
      <p>
          4999
      </p>
    </div>
  </div>
</div>
            </li>
        </ul>
    </nav>
    <br />
    <p>
        מקווה שנהניתם
    </p>
</asp:Content>

